
/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

CREATE DATABASE /*!32312 IF NOT EXISTS*/ `kps_classfinder` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;

USE `kps_classfinder`;
DROP TABLE IF EXISTS `rooms`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `rooms` (
  `id` int NOT NULL AUTO_INCREMENT,
  `room_code` varchar(255) NOT NULL,
  `building_name` varchar(255) NOT NULL,
  `floor` varchar(50) DEFAULT '-',
  `pin_x` decimal(6,3) DEFAULT NULL,
  `pin_y` decimal(6,3) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=50 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

LOCK TABLES `rooms` WRITE;
/*!40000 ALTER TABLE `rooms` DISABLE KEYS */;
INSERT INTO `rooms` VALUES (1,'ห้องประชุมใหญ่','อาคารเรียนรวม 3 (ศร.3)','1',0.000,0.000),(2,'ห้องประชุมกลาง','อาคารเรียนรวม 3 (ศร.3)','1',0.000,0.000),(3,'ห้องทะเบียน','อาคารเรียนรวม 3 (ศร.3)','1',0.000,0.000),(4,'e-Service','อาคารเรียนรวม 3 (ศร.3)','1',0.000,0.000),(5,'สำนักงาน','อาคารเรียนรวม 3 (ศร.3)','1',0.000,0.000),(6,'ห้องธุรการ','อาคารเรียนรวม 3 (ศร.3)','1',0.000,0.000),(7,'ห้องผลิตสื่อการเรียนการสอน','อาคารเรียนรวม 3 (ศร.3)','1',0.000,0.000),(8,'โสตทัศนศึกษา','อาคารเรียนรวม 3 (ศร.3)','1',0.000,0.000),(9,'Service+CCTV','อาคารเรียนรวม 3 (ศร.3)','1',0.000,0.000),(10,'การศึกษาทั่วไป','อาคารเรียนรวม 3 (ศร.3)','1',0.000,0.000),(11,'ร้านค้า','อาคารเรียนรวม 3 (ศร.3)','1',0.000,0.000),(12,'LH3-201','อาคารเรียนรวม 3 (ศร.3)','2',0.000,0.000),(13,'LH3-202','อาคารเรียนรวม 3 (ศร.3)','2',0.000,0.000),(14,'LH3-203','อาคารเรียนรวม 3 (ศร.3)','2',0.000,0.000),(15,'LH3-204','อาคารเรียนรวม 3 (ศร.3)','2',0.000,0.000),(16,'LH3-205','อาคารเรียนรวม 3 (ศร.3)','2',0.000,0.000),(17,'LH3-206','อาคารเรียนรวม 3 (ศร.3)','2',0.000,0.000),(18,'LH3-207','อาคารเรียนรวม 3 (ศร.3)','2',0.000,0.000),(19,'LH3-208','อาคารเรียนรวม 3 (ศร.3)','2',0.000,0.000),(20,'LH3-209','อาคารเรียนรวม 3 (ศร.3)','2',0.000,0.000),(21,'LH3-210','อาคารเรียนรวม 3 (ศร.3)','2',0.000,0.000),(22,'LH3-211','อาคารเรียนรวม 3 (ศร.3)','2',0.000,0.000),(23,'LH3-301','อาคารเรียนรวม 3 (ศร.3)','3',0.000,0.000),(24,'LH3-302','อาคารเรียนรวม 3 (ศร.3)','3',0.000,0.000),(25,'LH3-303','อาคารเรียนรวม 3 (ศร.3)','3',0.000,0.000),(26,'LH3-304','อาคารเรียนรวม 3 (ศร.3)','3',0.000,0.000),(27,'LH3-305','อาคารเรียนรวม 3 (ศร.3)','3',0.000,0.000),(28,'LH3-306','อาคารเรียนรวม 3 (ศร.3)','3',0.000,0.000),(29,'LH3-307','อาคารเรียนรวม 3 (ศร.3)','3',0.000,0.000),(31,'ห้องรับรอง','อาคารเรียน 80 ปี','1',0.000,0.000),(32,'ร้านค้า','อาคารเรียน 80 ปี','1',0.000,0.000),(33,'KH-201','อาคารเรียน 80 ปี','2',0.000,0.000),(34,'KH-202','อาคารเรียน 80 ปี','2',0.000,0.000),(35,'KH-203','อาคารเรียน 80 ปี','2',0.000,0.000),(36,'KH-204','อาคารเรียน 80 ปี','2',0.000,0.000),(37,'KH-205','อาคารเรียน 80 ปี','2',0.000,0.000),(38,'KH-206','อาคารเรียน 80 ปี','2',0.000,0.000),(39,'KH-207','อาคารเรียน 80 ปี','2',0.000,0.000),(40,'KH-208','อาคารเรียน 80 ปี','2',0.000,0.000),(41,'ห้องเจ้าหน้าที่','อาคารเรียน 80 ปี','2',0.000,0.000),(42,'ห้องประชุม','อาคารเรียน 80 ปี','2',0.000,0.000),(43,'ห้องละหมาด','อาคารเรียน 80 ปี','2',0.000,0.000),(44,'ห้องพักอาจารย์','อาคารเรียน 80 ปี','2',0.000,0.000),(45,'ห้องรับรอง','อาคารเรียน 80 ปี','2',0.000,0.000),(46,'หอประชุม จงรัก วัชรินทร์รัตน์','อาคารเรียน 80 ปี','2',0.000,0.000),(47,'CO-WORKING SPACE','อาคารเรียน 80 ปี','2',0.000,0.000);
/*!40000 ALTER TABLE `rooms` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

